{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "dtype": "float32", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 128, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 10, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax"}}], "keras_version": "2.0.5"}